In [30]:
#!pip install mysql-connector-python

In [31]:
import mysql.connector

In [32]:
'''
tomakeconnection with mysql server we have to use the connect() method. Provide mysql server location,username,password 
'''

'\ntomakeconnection with mysql server we have to use the connect() method. Provide mysql server location,username,password \n'

In [33]:
db_conn=mysql.connector.connect(
    host="localhost",
    user="root"
)

In [34]:
print(db_conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000220A0FC6A60>

In [35]:
# creat a cursor which will implement sql cmdson the database. It is createdusing the cursor method

In [36]:
cursor=db_conn.cursor()

In [37]:
cursor

In [38]:
cursor.execute("show databases;")

In [39]:
# to fetch all the records fromthe output of an executed SQL query,wehave touse fetchall() method of the cursor object

In [40]:
cursor.fetchall()

[('fifa19',),
 ('information_schema',),
 ('itvedant',),
 ('movies',),
 ('mysql',),
 ('performance_schema',),
 ('phpmyadmin',),
 ('production',),
 ('sales',),
 ('sql2_4',),
 ('sql_lab',),
 ('test',)]

In [41]:
# use database
cursor.execute("use fifa19")

In [42]:
# show tables

In [43]:
cursor.execute("show tables")

In [44]:
cursor.fetchall()

[('emp',), ('emp_constarints',), ('players',), ('sales',)]

In [45]:
# toclose the curent object

In [46]:
#cursor.close()

In [47]:
cursor.execute("select * from sales;")

In [48]:
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.datetime(2020, 9, 12, 0, 0), 2),
 (2, 'Julie', 'Headphone', datetime.datetime(2020, 9, 12, 0, 0), 1),
 (3, 'Crystal', 'Speaker', datetime.datetime(2020, 9, 12, 0, 0), 3)]

In [ ]:
# retrieving records from a table

In [50]:
cursor.execute("select * from sales where years > 1;")
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.datetime(2020, 9, 12, 0, 0), 2),
 (3, 'Crystal', 'Speaker', datetime.datetime(2020, 9, 12, 0, 0), 3)]

In [51]:
# inserting records into a table

cursor.execute("insert into sales values(4,'Daniel','laptop','2020-10-11',3);")
cursor.execute("select * from sales")
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.datetime(2020, 9, 12, 0, 0), 2),
 (2, 'Julie', 'Headphone', datetime.datetime(2020, 9, 12, 0, 0), 1),
 (3, 'Crystal', 'Speaker', datetime.datetime(2020, 9, 12, 0, 0), 3),
 (4, 'Daniel', 'laptop', datetime.datetime(2020, 10, 11, 0, 0), 3)]

In [52]:
# to commit the changes to the database, we have touse the commit() method of database connection object
db_conn.commit()
# now checkthe updated database from mysql shell

In [53]:
# inserting multiple records

data=[(5,'Niel','Headphone','2020-10-12',1),
      (6,'Simran','Monitor','2020-10-12',1)    
]

In [54]:
# insert query.Specify parameter using %s
stmt="insert into sales values(%s,%s,%s,%s,%s)"

In [ ]:
# to insert multiple records together,we have to use the executemany() method of the cursor object.
# it takes a query and a set of parameters and implements the query with all the parameters

In [55]:
cursor.executemany(stmt,data)

In [56]:
cursor.execute("select * from sales")
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.datetime(2020, 9, 12, 0, 0), 2),
 (2, 'Julie', 'Headphone', datetime.datetime(2020, 9, 12, 0, 0), 1),
 (3, 'Crystal', 'Speaker', datetime.datetime(2020, 9, 12, 0, 0), 3),
 (4, 'Daniel', 'laptop', datetime.datetime(2020, 10, 11, 0, 0), 3),
 (5, 'Niel', 'Headphone', datetime.datetime(2020, 10, 12, 0, 0), 1),
 (6, 'Simran', 'Monitor', datetime.datetime(2020, 10, 12, 0, 0), 1)]

In [57]:
# update records in a table
cursor.execute("update sales set name='Tom' where name='Harry'")
cursor.execute("select * from sales where name='Tom'")
cursor.fetchall()

[(1, 'Tom', 'Iphone', datetime.datetime(2020, 9, 12, 0, 0), 2)]

In [58]:
# delete records from a table
cursor.execute("delete from sales where name='Tom'")
cursor.execute("select * from sales where name='Tom'")
cursor.fetchall()

[]

In [59]:
db_conn.commit()

In [ ]:
# SQL into pandas dataframe

In [60]:
import pandas as pd

In [61]:
cursor.execute("select * from sales")

In [62]:
data=cursor.fetchall()

In [63]:
# convert result intopandas datarame
df=pd.DataFrame.from_records(data,columns=['id','name','product','sale_date','quantity'])

In [64]:
df.head()

   id     name    product  sale_date  quantity
0   2    Julie  Headphone 2020-09-12         1
1   3  Crystal    Speaker 2020-09-12         3
2   4   Daniel     laptop 2020-10-11         3
3   5     Niel  Headphone 2020-10-12         1
4   6   Simran    Monitor 2020-10-12         1

In [ ]:
# pandas df to sql

In [65]:
df

   id     name    product  sale_date  quantity
0   2    Julie  Headphone 2020-09-12         1
1   3  Crystal    Speaker 2020-09-12         3
2   4   Daniel     laptop 2020-10-11         3
3   5     Niel  Headphone 2020-10-12         1
4   6   Simran    Monitor 2020-10-12         1

In [71]:
# function to convert dataframe records to tuples

def sql_records(df):
    #list to store records as tuples
    list_of_records=[]
    # converting each dataframe record to tuple
    for row in df.to_records(index=False):
        #appending record tuple to a list
        list_of_records.append(tuple((int(row[0]),row[1],row[2],pd.Timestamp(row[3]),int(row[4]))))
    #return the list of tuples    
    return list_of_records

In [72]:
# convert df records to the list of tuples
output_result=sql_records(df)

In [73]:
output_result

[(2, 'Julie', 'Headphone', Timestamp('2020-09-12 00:00:00'), 1),
 (3, 'Crystal', 'Speaker', Timestamp('2020-09-12 00:00:00'), 3),
 (4, 'Daniel', 'laptop', Timestamp('2020-10-11 00:00:00'), 3),
 (5, 'Niel', 'Headphone', Timestamp('2020-10-12 00:00:00'), 1),
 (6, 'Simran', 'Monitor', Timestamp('2020-10-12 00:00:00'), 1)]

In [80]:
# create a new table

cursor.execute(
'''
create table sales_2(id int,name varchar(20),product varchar(20),sale_data date,quantity int)
'''
)

'\n)\n'

In [75]:
# sql query stmt
stmt='''insert into sales_2 values(%s,%s,%s,%s,%s)'''
# execute query
#cursor.executemany(stmt,output_result)

In [76]:
cursor.execute("select * from sales_2")
cursor.fetchall()

[(2, 'Julie', 'Headphone', datetime.date(2020, 9, 12), 1),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3),
 (4, 'Daniel', 'laptop', datetime.date(2020, 10, 11), 3),
 (5, 'Niel', 'Headphone', datetime.date(2020, 10, 12), 1),
 (6, 'Simran', 'Monitor', datetime.date(2020, 10, 12), 1)]

In [77]:
cursor.close()

True

In [78]:
db_conn.commit()

In [ ]:
#ETl---Lets say we have a restaurant and it has multiple sources that is generating data everyday like dbms,json,csv,xml

# and it make predictions regarding future sales or some business decision are taken.

# now the inputs are in different formats but for a decision making process we require that the data is in single format
# like in a spreadsheet or in a database,so to bridge this gap between our raw data and clean data,we have etl process.
# etl stands for extraction,transformation and load,in simple terms it prepares raw data for decision making

# extract extracts data from various sources,this extraction can either be full or partial
# transforming data involves preprocessing of data like removing null values,duplicate values and all of this happens in a
# staging area..which is a temporary place like database where all of these transformation happens
# load is the final step where we load data into target location..this loading can be of2 types, like incremental or full
# when the data is loaded after extraction and transformation for the very first time, that is a full load
# and any subsequent loading of data,for a new entry is known as a partial load.

# the mechanism trough which etl process occur is called as etl pipeline,wecan automate etl pipeline and schedule it to run
# based on business requirement

# there are multiple rulesthat fecilitate using etl pipelines like,informatica,talend,pentaho,etc.

# undersatnding the context--letssay there is an e-commerce website on which there are 100 differrent products to purchase
# in 3 different categories- which are Ac, refrigerators,and microwave,
# the data is availablein csv files and mysql tables

#product data is stored in csv file,the data change in tis file rarely.New products are addedonce in months.
# this file has 4 different colproduct id,productname,product category,product price
# next we have user table. whenever we have new user the data is stored in this table.
# in our website every 2 secs a new user is signing up and their details have been stored
# in this tablewe have unique user id,user email,user name,source from which user came like instagram,fb,etc,isprime,signuptime
# transaction table-if any product is soldin our website,then the trx details arestored here-on an avg every5-15 secs
# a trxhappens in our website,and wehave 5 different cols--transaction id,user id ,product id,transaction time,price
# our website also has a page where people can apply for a refund
# now there are some rules regarding refund--refund will be done only if the trx is done in last 48 hrs.